{
  "about me": "über mich",
  "my skills": "skills",
  "projects": "projekte",
  "Say Hi!": "Sag Hi!",
  "Developer": "Entwickler",

  "Hi, i'm Viktor": "Hi, ich bin Viktor",
  "Fullstack developer with focus on Angular and Java": "Fullstack-Entwickler mit Fokus auf Angular und Java",
  "aboutMe_content1": "Hallo, mein Name ist Viktor, ich bin ein engagierter Web-Entwickler aus Waldbröl im Oberbergischen Kreis.",
  "aboutMe_content2": "Mit Begeisterung für moderne Webtechnologien entwickle ich Anwendungen mit Java Spring Boot, JavaScript und Angular – sowohl in Eigenprojekten als auch im Team, stets offen für neue Herausforderungen.",
  "aboutMe_content3": "Die Vielfalt der Programmierung fasziniert mich, und als Junior Entwickler setze ich alles daran, mein Wissen kontinuierlich zu erweitern und in verschiedenen Projekten praktisch anzuwenden.",
  "aboutMe_content4": "Sie sind herzlich eingeladen, mein öffentliches Portfolio zu erkunden.",
  "Let's talk": "Kontakt",
  "Feel free": "Fühlen Sie sich frei, meine Entwicklungsprojekte auszuprobieren und in ihren Code zu schauen...",
  "This stop-smoking app tracks daily cigarette consumption and shows saved cigarettes and money. Additionally, users can add or delete personal motivations and goals with prices.": "Diese Stop-Smoking-App ermöglicht das Erfassen der täglich gerauchten Zigaretten und zeigt gesparte Zigaretten sowie Geld an. Zusätzlich können persönliche Motivationen und Ziele mit Preisen hinzugefügt oder gelöscht werden.",
  "The page may take up to two minutes to load!": "Das Laden der Seite kann bis zu zwei Minuten dauern!",
  "A software designed to efficiently manage manufacturing processes in machining operations. It allows for the management of employees, machine assignments, and project planning.": "Ein Programm zur effizienten Steuerung der Fertigungsprozesse in der Zerspanung. Es ermöglicht die Verwaltung von Mitarbeitern, die Zuweisung von Maschinen und die Planung von Projekten.",
  "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions.": "Aufgabenmanager nach dem Vorbild des Kanban-Systems. Erstellen und organisieren Sie Aufgaben mit Hilfe von Drag-and-Drop-Funktionen.",
  "Jump, run and throw game based on object-oriented approach. Help Pepe to find coins and tabasco salsa to fight against the crazy hen.": "Jump & Run-Spiel, das auf einem objektorientierten Ansatz basiert. Hilf Pepe, Münzen und Tabasco-Salsa zu finden, um gegen die verrückte Henne zu kämpfen.",
  "Live Test": "Testen",
  "Do you have any questions?": "Sie haben noch Fragen?",
  "Let's talk about them!": "Schreiben Sie mich gerne an!",
  "Your Name": "Ihr Name",
  "Your email": "Ihre Email",
  "Your message": "Ihre Nachricht",
  "Please enter your name": "Bitte geben Sie Ihren Namen ein",
  "Please enter your e-mail": "Bitte geben Sie eine gültige Email-Adresse ein",
  "Please leave a message": "Bitte hinterlassen Sie eine Nachricht",
  "I've read the": "Ich habe die",
  "privacy policy": "Datenschutzbestimmungen",
  "and agree to the processing of my data as outlined": " gelesen und erkläre mich mit der Verarbeitung meiner Daten wie beschrieben einverstanden",
  "Send message": "Nachricht senden",
  "imprint": "Impressum",
  "Image rights": "Bildrechte:",
  "disclaimer": "Disclaimer - Rechtliche Hinweise",
  "content warning": " Warnhinweis zu Inhalten",
  "The free and freely accessible content of this website has been created with the greatest possible care. The provider of this website assumes no responsibility for the accuracy and timeliness of the free and freely accessible free and freely accessible journalistic guides and news. Contributions identified by name reflect the opinion of the respective author and not always the opinion of the provider. Simply by calling up free and freely accessible content does not constitute a contractual relationship between the user and the provider. In this respect, the provider's intention to be legally bound is lacking.": "Die kostenlosen und frei zugänglichen Inhalte dieser Webseite wurden mit größtmöglicher Sorgfalt erstellt. Der Anbieter dieser Webseite übernimmt jedoch keine Gewähr für die Richtigkeit und Aktualität der bereitgestellten kostenlosen und frei zugänglichen journalistischen Ratgeber und Nachrichten. Namentlich gekennzeichnete Beiträge geben die Meinung des jeweiligen Autors und nicht immer die Meinung des Anbieters wieder. Allein durch den Aufruf der kostenlosen und frei zugänglichen Inhalte kommt keinerlei Vertragsverhältnis zwischen dem Nutzer und dem Anbieter zustande, insoweit fehlt es am Rechtsbindungswillen des Anbieters.",
  "external links": "Externe Links",
  "This website contains links to third-party websites (external links). These websites are subject to the liability of the respective operators. When the external links were first created, the provider checked the third-party content for any legal violations. No legal violations were apparent at that time. The provider has no influence whatsoever on the current and future design and content of the linked pages. The inclusion of external links does not mean that the provider adopts the content behind the reference or link as its own. The provider cannot reasonably be expected to constantly monitor external links without concrete evidence of legal violations. However, such external links will be deleted immediately if we become aware of any legal violations.": "Diese Website enthält Verknüpfungen zu Websites Dritter (externe Links). Diese Websites unterliegen der Haftung der jeweiligen Betreiber. Der Anbieter hat bei der erstmaligen Verknüpfung der externen Links die fremden Inhalte daraufhin überprüft, ob etwaige Rechtsverstöße bestehen. Zu dem Zeitpunkt waren keine Rechtsverstöße ersichtlich. Der Anbieter hat keinerlei Einfluss auf die aktuelle und zukünftige Gestaltung und auf die Inhalte der verknüpften Seiten. Das Setzen von externen Links bedeutet nicht, dass sich der Anbieter die hinter dem Verweis oder Link liegenden Inhalte zu Eigen macht. Eine ständige Kontrolle der externen Links ist für den Anbieter ohne konkrete Hinweise auf Rechtsverstöße nicht zumutbar. Bei Kenntnis von Rechtsverstößen werden jedoch derartige externe Links unverzüglich gelöscht.",
  "copyrights": "Urheber- und Leistungsschutzrechte",
  "The content published on this website is subject to German copyright and ancillary copyright law. Any use not permitted by German copyright and ancillary copyright law requires the prior written consent of the provider or respective rights holder. This applies in particular to the duplication, editing, translation, storage, processing or reproduction of content in databases or other electronic media and systems. Third-party content and rights are identified as such. The unauthorized reproduction or distribution of individual contents or complete pages is not permitted and is punishable by law. Only the production of copies and downloads for personal, private and non-commercial use is permitted.": "Die auf dieser Website veröffentlichten Inhalte unterliegen dem deutschen Urheber- und Leistungsschutzrecht. Jede vom deutschen Urheber- und Leistungsschutzrecht nicht zugelassene Verwertung bedarf der vorherigen schriftlichen Zustimmung des Anbieters oder jeweiligen Rechteinhabers. Dies gilt insbesondere für Vervielfältigung, Bearbeitung, Übersetzung, Einspeicherung, Verarbeitung bzw. Wiedergabe von Inhalten in Datenbanken oder anderen elektronischen Medien und Systemen. Inhalte und Rechte Dritter sind dabei als solche gekennzeichnet. Die unerlaubte Vervielfältigung oder Weitergabe einzelner Inhalte oder kompletter Seiten ist nicht gestattet und strafbar. Lediglich die Herstellung von Kopien und Downloads für den persönlichen, privaten und nicht kommerziellen Gebrauch ist erlaubt.",
  "The presentation of this website in external frames is only permitted with written permission.": "Die Darstellung dieser Website in fremden Frames ist nur mit schriftlicher Erlaubnis zulässig.",
  "Special terms of use": "Besondere Nutzungsbedingungen",
  "Insofar as special conditions for individual uses of this website deviate from the aforementioned paragraphs, this will be expressly indicated at the appropriate point. In this case, the special terms of use apply in each individual case.": "Soweit besondere Bedingungen für einzelne Nutzungen dieser Website von den vorgenannten Paragraphen abweichen, wird an entsprechender Stelle ausdrücklich darauf hingewiesen. In diesem Falle gelten im jeweiligen Einzelfall die besonderen Nutzungsbedingungen.",
  "Source:": "Quelle:",
  "Thank you!": "Vielen Dank!",
  "I received your messsage and will answer you soon!": "Ich habe Ihre Nachricht erhalten und werde Ihnen bald antworten!",
  "FamNotify is a real-time notification system for families. Parents send reminders as emojis or GIFs, which children can acknowledge with a click. Thanks to Express, Vue.js, and Socket.IO, the transmission is instantaneous—ideal for short messages in everyday family life.": "FamNotify ist ein Echtzeit-Benachrichtigungssystem für Familien. Eltern senden Erinnerungen als Emojis oder GIFs, die Kinder mit einem Klick bestätigen können. Dank Express, Vue.js und Socket.IO erfolgt die Übertragung verzögerungsfrei – ideal für kurze Mitteilungen im Familienalltag.",
  "Discover my other projects, in which I combine different technologies and approaches to expand my knowledge and skills.": "Entdecken Sie auch meine weiteren Projekte, in denen ich verschiedene Technologien und Ansätze kombiniere, um meine Kenntnisse und Fähigkeiten zu erweitern.",
  "URL Shortener is a full-stack web application that allows users to shorten long URLs into more manageable links. The application also provides analytics on the usage of the shortened URLs.": "URL Shortener ist eine Full Stack Webanwendung, die es Benutzern ermöglicht, lange URLs in besser verwaltbare Links zu kürzen. Die Anwendung bietet außerdem Analysen zur Nutzung der verkürzten URLs.",
  "An Angular fake store. It serves as a sample application for using Angular features such as signals, routing, services, and HTTP client. It uses the FakeStore API as a data source and supports dynamic routing, category filtering, and shopping cart management.": "Ein Angular Fake-Shop. Es dient als Beispielanwendung für die Verwendung von Angular-Funktionen wie signals, routing, services und HTTP-Client. Es nutzt die FakeStore-API als Datenquelle und unterstützt dynamische Routen, Filterung nach Kategorie und Verwaltung eines Warenkorbs.",
  "All": "Alle",
  "Projects": "Projekte"
}
